/*************************************************************************
> File Name: euler28.c
> Author: 
> Mail: O(∩_∩)Ohaha！
> Created Time: 2018年08月18日 星期六 23时50分52秒
************************************************************************/
/*从数字1开始并沿顺时针方向向右移动，形成5乘5螺旋，如下所示：
*
* 21 22 23 24 25
* 20  7  8  9 10
* 19  6  1  2 11
* 18  5  4  3 12
* 17 16 15 14 13
*
* 可以验证对角线上的数字之和为101。
*
* 以相同方式形成的1001乘1001螺旋中对角线上的数字总和是多少？*/
/*
*   9 = n*n 
*   7 = n*n-n+1
*   5 = n*n-n+1-n+1
*   3 = n*n-n+1-n+1-n+1
*             */
#include <stdio.h>
int main() {
    int sum = 1;
    for (int i = 3; i <= 1001; i += 2) {
        sum += 4 * i * i - 6 * i + 6;
    }
    printf("%d\n",sum);
    return 0;
}
//本题找规律
