/*************************************************************************
> File Name: euler06.c
> Author:
> Mail: O(∩_∩)Ohaha！.@163.com
> Created Time: 2018年08月17日 星期五 21时07分37秒
************************************************************************/
/*
*平方的和与和的平方之差

前十个自然数的平方的和是

1^2 + 2^2 + … + 10^2 = 385
前十个自然数的和的平方是

(1 + 2 + … + 10)^2 = 55^2 = 3025
因此前十个自然数的平方的和与和的平方之差是 3025 − 385 = 2640。

求前一百个自然数的平方的和与和的平方之差。
* */
#include <stdio.h>
int main() {
    int sum1 = 0, sum2 = 0, n = 100;
    do {
        sum1 += n;
        sum2 += n * n;


    } while (--n);
    printf("%d\n", sum1 * sum1 - sum2);
    return 0;
}
//暴力：硬做
