/*************************************************************************
	> File Name: oula25.c
	> Author: 
	> Mail: 
	> Created Time: 2018年07月27日 星期五 09时57分59秒
 ************************************************************************/
/*
*一千位斐波那契数(循环)

斐波那契数列是按如下递归关系定义的数列：
F1 = 1 F2 = 1
Fn = Fn−1 + Fn−2

因此斐波那契数列的前12项分别是：
F1 = 1
F2 = 1
F3 = 2
F4 = 3
F5 = 5
F6 = 8
F7 = 13
F8 = 21
F9 = 34
F10 = 55
F11 = 89
F12 = 144

第一个有三位数字的项是第12项F12。

在斐波那契数列中，第一个有1000位数字的是第几项？


* */
#include <stdio.h>
int fib[3][1005] = {{0, 0}, {1, 1}, {1, 1}};//将第0位空出，从第一位开始存数
int n = 2;

int main() {
    while (fib[n % 3][0] < 1000) {
        n += 1;
        int *a = fib[n % 3], *b = fib[(n - 1) % 3], *c = fib[(n - 2) % 3];
        a[0] = b[0];
        for (int i = 1; i <= b[0]; i++) {
            a[i] = b[i] + c[i];
        }
        for (int i = 1; i <= a[0]; i++) {
            if (a[i] < 10) continue;
            a[i + 1] += a[i] / 10;
            a[i] %= 10;
            a[0] += (a[0] == i);
        }
    }
    printf("%d\n", n);

    return 0;
}

